backend/envelope.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Body>
    <nfe:nfeDadosMsg xmlns:nfe="http://www.portalfiscal.inf.br/nfe/wsdl/NFeDistribuicaoDFe">
      <!-- corpo propositalmente vazio -->
    </nfe:nfeDadosMsg>
  </soap:Body>
</soap:Envelope>
